Question 1

In [10]:
import pandas as pd  #import pandas library

In [11]:
series = pd.Series([4,8,15,16,23,42])  #creating pandas series

In [12]:
print(series) # print output

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Question 2

In [13]:
variable = ['sun', 'mercury', 'venus', 'earth', 'mars', 'jupiter', 'saturn', 'uranus', 'neptune', 'pluto'] # created variable of list type
solar_system = pd.Series(variable) # used pandas.Series function on variable

In [14]:
solar_system

0        sun
1    mercury
2      venus
3      earth
4       mars
5    jupiter
6     saturn
7     uranus
8    neptune
9      pluto
dtype: object

Question 3

In [15]:
data = {'Name': ['Alice', 'Bob', 'Claire'],
       'Age':[25, 30, 27],
       'Gender': ['Female', 'Male', 'Female']} # given data

In [16]:
dataframe = pd.DataFrame(data) # create dataframe on given data

In [17]:
dataframe # print datafranme

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Question 4

A Pandas DataFrame is a two dimentional data structure with labeled rows and columns. It is similar to a spredsheet or a SQL table, Each column of a DataFrame is a Series. DataFrames are often used to store and analyze data.

One of the main differences between DtaFrame and Series is that a DataFrame can have multipe columns, while a Series can only have one. This means that DataFrame can store more complex and heterogeneous data, while a Series can store more simple and homogeneous data. Another difference is that a DataFrame can have different data types for each column, while a Series can only have one data type for the whole array. This means that DataFrame can handle mixed data types, such as numbers, strings, booleans, or dates, while a Series can only handle one data type at a time.

For example,

In [23]:
# Example of DataFrame
df = {"Name": ['Alice','Bob','Claire'],
     "Age": [25, 30, 27]}
pd.DataFrame(df)

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [25]:
# Example of Series
df1 = ['Alice','Bob','Claire']
pd.Series(df1)

0     Alice
1       Bob
2    Claire
dtype: object

In [27]:
dataframe.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

Question 5

some common functions you can use to manipulate data in a Pandas DataFrame:
- read_csv(): Used to retrieve data from CSV files in the form of fataframe
- head(): Used to return top n (by default 5) values of data frame or series
- tail(): Used to return last n (by default 5) values of data frame or series
- dtypes(): Used to return a series with the data type of each column
- fillna(): Used to replace missing values in a Data Frame
- mean(): Used to calculate the mean of series or data frame
- std(): Used to calculate standard deviation of a series or dataframe
- describe(): calculate summery statistics for a series or dataframe

For example, we have series of solar_system in question 2. Using head function on this series:

In [29]:
solar_system.head()

0        sun
1    mercury
2      venus
3      earth
4       mars
dtype: object

Question 6

There are three data structures provided by the Pandas module: Series, Data frame and Panels

Series is one dimentionl. it is value mutable but size unmutable. This means that once you have created a Series, you cannot add or remove elements from it.

Data Frame is two dimentional. it is both value and size mutable. This means that you can add or remove elements from them as needed.

Panel is three dimentional. it is both value and size mutable. This means that you can add or remove elements from them as needed.

Question 7

In [40]:
Name = pd.Series(['Ram','Sita','Lakshman']) # make first series
Gender = pd.Series(['Male','Female','Male']) #make second series
df2 = {'Name':Name, 'Gender':Gender}  # name columns and give data
pd.DataFrame(df2)  # make dataframe from series

       Name  Gender
0       Ram    Male
1      Sita  Female
2  Lakshman    Male